app/controllers/funds_controller.rb

INSERT INTO "funds" ("created_at", "name", "updated_at") VALUES ('2013-04-06 03:08:01.587000', 'Steel Capital', '2013-04-06 03:08:01.587000')
---
  def create
    @fund = Fund.new(params[:fund])
    if @fund.save

SELECT "funds".* FROM "funds" WHERE "funds"."id" = 1 LIMIT 1
SELECT "flows".* FROM "flows" WHERE "flows"."fund_id" = 1 ORDER BY flows.day
---
  def show
    @fund = Fund.find(params[:id])
    @flows = Flow.where(fund_id: @fund.id)

SELECT "funds".* FROM "funds" WHERE "funds"."id" = 4 LIMIT 1
---
  def edit
    @fund = Fund.find(params[:id])

SELECT "funds".* FROM "funds" WHERE "funds"."id" = 4 LIMIT 1
---
  def update
    @fund = Fund.find(params[:id])

DELETE FROM "funds" WHERE "funds"."id" = 2
SELECT "funds".* FROM "funds" WHERE "funds"."id" = 2 LIMIT 1
---
  def destroy
    Fund.find(params[:id]).destroy

SELECT "funds".* FROM "funds" ORDER BY name
---
  def dashboard
    @funds = Fund.order(:name)